simulations/102.3.org
#+title: Controle de bibliotecas compartilhadas [ldconfig, ld.so.conf, ld.so]
#+description: simulado

* 1
você é administrador de um servidor web e precisa instalar uma nova aplicação que usa bibliotecas dinâmicas. antes de instalar você precisa testar a aplicação, é necessário definir a variável _____LD_LIBRARY_PATH____________ com o seguinte valor /usr/local/lib que contém a biblioteca dinâmica e em seguida exporte a variável.

* 2
O arquivo /etc/____ld.so.cache_________contém o mapeamento de todas as bibliotecas disponíveis no sistema ?

* 3
O linker ___ld.so_____ é usado sempre que uma aplicação precisa carregar na memoria uma biblioteca dinâmica.

* 4
O sysadmin deve incluir a localização do diretório que contém a biblioteca dinâmica no arquivo /etc/_____ld.so.conf________.

* 5
Após incluir o diretório que contém a localização da biblioteca dinâmica o comando __ldconfig____ deve ser executado para atualizar o arquivo /etc/ld.so.cache


