simulations/102.3.tex
% Created 2025-09-11 qui 21:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{ilak}
\date{\today}
\title{Controle de bibliotecas compartilhadas [ldconfig, ld.so.conf, ld.so]}
\hypersetup{
 pdfauthor={ilak},
 pdftitle={Controle de bibliotecas compartilhadas [ldconfig, ld.so.conf, ld.so]},
 pdfkeywords={},
 pdfsubject={simulado},
 pdfcreator={Emacs 29.3 (Org mode 9.7.31)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{1}
\label{sec:orgebded0c}
você é administrador de um servidor web e precisa instalar uma nova aplicação que usa bibliotecas dinâmicas. antes de instalar você precisa testar a aplicação, é necessário definir a variável \uline{\uline{\uline{\uline{\uline{LD\textsubscript{LIBRARY}\textsubscript{PATH}\_\_\_\_\_\_\_}}}}} com o seguinte valor /usr/local/lib que contém a biblioteca dinâmica e em seguida exporte a variável.
\section{2}
\label{sec:org54bb601}
O arquivo /etc/\_\_\_\textsubscript{ld.so.cache}\_\_\_\_\_\_\_\_\textsubscript{contém} o mapeamento de todas as bibliotecas disponíveis no sistema ?
\section{3}
\label{sec:orgaee3079}
O linker \uline{\uline{\uline{ld.so\_\_}}} é usado sempre que uma aplicação precisa carregar na memoria uma biblioteca dinâmica.
\section{4}
\label{sec:org2187184}
O sysadmin deve incluir a localização do diretório que contém a biblioteca dinâmica no arquivo /etc/\_\_\_\_\textsubscript{ld.so.conf}\_\_\_\_\_\_\_\_.
\section{5}
\label{sec:org1563fd8}
Após incluir o diretório que contém a localização da biblioteca dinâmica o comando \uline{\uline{ldconfig\_\_}} deve ser executado para atualizar o arquivo /etc/ld.so.cache


\begin{quote}
fewafwa
\end{quote}
\end{document}
